[
    {
        "altura": 10.0,
        "categoria": "GPU",
        "comprimento": 20.0,
        "descricao_longa": "O MECH traz um design focado no desempenho que mantém o essencial para realizar qualquer tarefa em mãos e arranjo confiável de duas ventoinhas em um design rígido permite que essa placa gráfica de aparência nítida se encaixe em qualquer construção\r\n \r\n\r\nBackplate\r\n \r\n\r\nUma placa traseira de acabamento escovado de aparência limpa reforça o comprimento do cartão.\r\n\r\n \r\n\r\nRESISTENTE O SUFICIENTE PARA APOIÁ-LO!\r\n \r\n\r\nO MECH foi criado para atendê-lo bem durante o jogo intenso. Este item lendário tem poder extra desbloqueado através do PCB personalizado.\r\n\r\n \r\n\r\nMELHOR PREVENIR DO QUE REMEDIAR\r\n \r\n\r\nFusíveis adicionais embutidos no PCB personalizado fornecem proteção adicional contra danos elétricos.\r\n\r\n \r\n\r\nFORJADO A PARTIR DE MATERIAIS APRIMORADOS\r\n \r\n\r\nUm design aprimorado de material de PCB com cobre espessado de 2 onças aumenta a condutividade, melhorando a dissipação de calor e a confiabilidade de alto desempenho.",
        "estoque": 10,
        "id": 1,
        "imagem": "pre_imagens/placa-de-video-rx-6750-xt.jpg",
        "largura": 20.0,
        "nome": "Placa de Vídeo RX 6750 XT Mech 2X 12G OC MSI AMD, 12 GB GDDR6 - XT MECH 2X 12G OC",
        "peso": 1.0,
        "preco": 3222.21,
        "preco_promocional": 2559.99,
        "publico": 1,
        "slug": "placa-de-video-rx-6750-xt-mech-2x-12g-oc-msi-amd-12-gb-gddr6-xt-mech-2x-12g-oc"
    },
    {
        "altura": 35.0,
        "categoria": "KIT",
        "comprimento": 10.0,
        "descricao_longa": "Características:\r\n\r\n- Marca: Redragon\r\n\r\n- Modelo: Zeus X\r\n\r\n \r\n\r\nEspecificações:\r\n\r\n- Diâmetro do driver: 53mm\r\n\r\n- Material das Earpads: Tecido de malha esportiva\r\n\r\n- Sensibilidade: 98 ± 3dB S.P.L. at 1KHz\r\n\r\n- Frequencia de resposta: 50Hz até 20000Hz\r\n\r\n- Impedancia: 64 Ohm ± 10%\r\n\r\n- Software: Sim\r\n\r\n \r\n\r\nIluminação:\r\n\r\n- RGB Redragon Chroma Mk.II\r\n\r\n \r\n\r\nCor:\r\n\r\n- Preto\r\n\r\n \r\n\r\nCabo e Conexão:\r\n\r\n- Conexão: 1x USB 2.0\r\n\r\n- Comprimento do cabo: 1.8m\r\n\r\n- Função de mute: Integrada no controle in line\r\n\r\n \r\n\r\nConteúdo da Embalagem:\r\n\r\n- 1x Headset Gamer Redragon Zeus X\r\n\r\n\r\nGarantia:\r\n12 meses de garantia\r\n\r\nPeso:\r\n1014 gramas (bruto com embalagem)",
        "estoque": 1,
        "id": 2,
        "imagem": "pre_imagens/headset-gamer-redragon-zeus-chroma-mk-ii-rgb-surround-7-1-usb.jpg",
        "largura": 10.0,
        "nome": "Headset Gamer Redragon Zeus X, Chroma Mk.II, RGB, Surround 7.1, USB, Drivers 53MM, Preto/Vermelho - H510-RGB",
        "peso": 0.5,
        "preco": 397.72,
        "preco_promocional": 279.99,
        "publico": 1,
        "slug": "headset-gamer-redragon-zeus-x"
    },
    {
        "altura": 10.0,
        "categoria": "PLC",
        "comprimento": 30.0,
        "descricao_longa": "Placa Mãe MSI H310M PRO-VDH\r\n \r\n\r\nDesempenho Sólido\r\nCom entrega de energia aprimorada e opções abrangentes de refrigeração para alimentar os processadores, além de suporte para armazenamento e memória mais rápidos.\r\n\r\n \r\n\r\nJogo Imersivo\r\nAs placas-mãe MSI fornecem um alto desempenho para Gamers com uma longa lista de recursos para melhorar sua experiência, incluindo redes ultra-rápidas para uma jogabilidade on-line mais suave, áudio puro com dicas posicionais para jogos FPS.",
        "estoque": 5,
        "id": 3,
        "imagem": "pre_imagens/placa-mae-msi-h310m-pro-vdh-intel-1151.jpg",
        "largura": 20.0,
        "nome": "Placa Mãe MSI H310M PRO-VDH, Intel 1151, m-ATX, DDR4 - H310M PRO-VDH",
        "peso": 1.5,
        "preco": 299.99,
        "preco_promocional": 0.0,
        "publico": 1,
        "slug": "placa-mae-msi-h310m-pro-vdh-intel-1151-m-atx-ddr4-h310m-pro-vdh"
    },
    {
        "altura": 35.0,
        "categoria": "CPU",
        "comprimento": 5.0,
        "descricao_longa": "Monitor Gamer Acer QG240Y Nitro 23.8 Full HD\r\n \r\n\r\nDiminui o Input Lag\r\nO Nitro QG240Y S3bipx conta com uma alta taxa de atualização de até 180Hz e até 1 ms VRB de tempo de resposta. Prepare-se para ver imagens mais suaves, sem rastros e sem rasgos.\r\n\r\nCom o Visual Response Boost (VRB) de 1 ms, o monitor reduz borrões, efeitos fantasmas e manchas nas imagens. Além disso, elimina o desfoque em objetos em movimento rápido.\r\n\r\n \r\n\r\nDesign ZeroFrame\r\nMonitor é igual exp: quanto mais, melhor. Jogue com múltiplos monitores sem problemas, o design ZeroFrame praticamente elimina as bordas para que você tenha uma verdadeira imersão no jogo.\r\n\r\n \r\n\r\nImagens Fluindo com Suavidade\r\nCom o AMD FreeSync Premium, a taxa de quadros do jogo é determinada pela sua placa de vídeo, não pela taxa de atualização fixa do monitor. Isso significa que os quadros do monitor são sincronizados com os quadros da placa gráfica, o que elimina a tela quebrada e oferece experiências de jogo muito suaves.",
        "estoque": 6,
        "id": 4,
        "imagem": "pre_imagens/monitor-gamer-acer-qg240y-nitro-23-8-full-hd-180hz-1ms-hdmi-e-displayport-95-.jpg",
        "largura": 40.0,
        "nome": "Monitor Gamer Acer QG240Y Nitro 23.8 Full HD, 180Hz, 1ms, HDMI e DisplayPort, 95% sRGB, HDR 10, FreeSync - UM.QQ0AA.304",
        "peso": 5.0,
        "preco": 1309.23,
        "preco_promocional": 999.99,
        "publico": 1,
        "slug": "monitor-gamer-acer-qg240y-nitro-238-full-hd-180hz-1ms-hdmi-e-displayport-95-srgb-hdr-10-freesync-umqq0aa304"
    },
    {
        "altura": 20.0,
        "categoria": "CPU",
        "comprimento": 5.0,
        "descricao_longa": "O G915 TKL oferece a mesma combinação vencedora de design sofisticado, tecnologias inovadoras e conjunto de recursos e desempenho que o G915 - agora em um design compacto tenkeyless que permite mais espaço para o movimento do mouse. Um teclado com switches mecânicos de baixo perfil - GL tactile e sem fio LIGHTSPEED de 1ms pro-grade, sendo capaz de fornecer até 40 horas de jogos ininterruptos com carga total. Totalmente personalizável, a tecnologia LIGHTSYNC RGB também reage à ação do jogo, áudio e cor da tela conforme você escolher. Com um design elegante, impossivelmente fino, mas durável e robusto, o G915 TKL leva os jogadores a uma dimensão de jogo mais elevada. A roda de volume e as teclas de mídia dedicadas fornecem controle rápido e fácil sobre vídeo, áudio e streaming.",
        "estoque": 1,
        "id": 5,
        "imagem": "pre_imagens/teclado-mecanico-gamer-sem-fio-logitech-g915-tkl-rgb-usb.jpg",
        "largura": 30.0,
        "nome": "Teclado Mecânico Gamer Sem Fio Logitech G915 TKL RGB LIGHTSYNC, USB ou Bluetooth, Ultrafino, Switch GL Tactile, Branco - 920-009660",
        "peso": 0.5,
        "preco": 1411.75,
        "preco_promocional": 849.99,
        "publico": 1,
        "slug": "teclado-mecanico-gamer-sem-fio-logitech-g915-tkl-rgb-lightsync-usb-ou-bluetooth-ultrafino-switch-gl-tactile-branco-920-009660"
    },
    {
        "altura": 10.0,
        "categoria": "CPU",
        "comprimento": 5.0,
        "descricao_longa": "SSD Kingston A400, 240GB, SATA, Leitura 500MB/s, Gravação 350MB/s\r\nSSD Kingston A400 é o mais confiável e durável do que um disco rígido A unidade de estado sólido A400 da Kingston aumenta drasticamente a resposta do seu computador com tempos incríveis de inicialização, carregamento e transferência, comparados a discos rígidos mecânicos.\r\n\r\n\r\nMais velocidade, SSD é 10x mais rápido \r\nReforçado com uma controladora de última geração para velocidades de leitura e gravação de até 500MB/s e 450MB/s, este SSD é 10x mais rápido do que um disco rígido tradicional para melhor desempenho, resposta ultrarrápida em multitarefas e um computador mais rápido de modo geral. Também mais confiável e durável do que um disco rígido, o A400 é feito com memória Flash.\r\n\r\n\r\nMais resistente\r\nO SSD Kingston A400, não existem partes móveis, com menor probabilidade de falhas do que um disco rígido mecânico.",
        "estoque": 1,
        "id": 6,
        "imagem": "pre_imagens/SSD-240.jpg",
        "largura": 10.0,
        "nome": "SSD 240 GB Kingston A400, SATA, Leitura: 500MB/s e Gravação: 350MB/s - SA400S37/240G",
        "peso": 0.5,
        "preco": 204.53,
        "preco_promocional": 124.99,
        "publico": 1,
        "slug": "ssd-240-gb-kingston-a400-sata-leitura-500mbs-e-gravacao-350mbs-sa400s37240g"
    },
    {
        "altura": 20.0,
        "categoria": "GAB",
        "comprimento": 30.0,
        "descricao_longa": "Gabinete Rise Mode Glass 06X Preto\r\n \r\n\r\nPara deixar seu Setup mais potente e cheio de estilo\r\nOs Gabinetes são a estrutura que une toda sua build, onde você vai querer algo que tenha flexibilidade para montagem da suas peças, garanta boa refrigeração dos componentes e que deixe tudo bonito. O Gabinete Rise Mode Glass 06X é a melhor escolha para tudo isso. Com acabamento externo em Vidro, dand um toque de estilo ao seu setup. Além de possuir espaço para 6 Fans (que não acompanham o gabinete).\r\n\r\n \r\n\r\nAcabamento em vidro temperado\r\nCom toda a sua parte interna na cor preta, o Gabinete Rise Mode Glass 06X Preto é a sua escolha perfeita para um setup organizado e muito cheio de estilo. O Gabinete Rise Mode é compatível com placas mãe padrão ATX / M-ATX / ITX, dando a você a possibilidade um PC Monstro.",
        "estoque": 10,
        "id": 7,
        "imagem": "pre_imagens/gabinete-gamer-rise-mode-glass-06x-lateral-em-vidro-fume-e-frontal-.jpg",
        "largura": 40.0,
        "nome": "Gabinete Gamer Rise Mode Glass 06X, Mid Tower, Lateral em Vidro Fumê e Frontal em Vidro Temperado, Preto - RM-CA-06X-FB",
        "peso": 6.0,
        "preco": 329.4,
        "preco_promocional": 199.99,
        "publico": 1,
        "slug": "gabinete-gamer-rise-mode-glass-06x-mid-tower-lateral-em-vidro-fume-e-frontal-em-vidro-temperado-preto-rm-ca-06x-fb"
    },
    {
        "altura": 10.0,
        "categoria": "PRC",
        "comprimento": 10.0,
        "descricao_longa": "Quando você tem a arquitetura de processador de desktop mais avançada do mundo para jogadores e criadores de conteúdo, as possibilidades são infinitas. Esteja você jogando os jogos mais recentes, projetando o próximo prédio ou processando dados, você precisa de um processador poderoso que possa lidar com tudo - e muito mais. Sem dúvida, os processadores AMD Ryzen série 5000 definem o padrão para jogadores e artistas.\r\n\r\n \r\n\r\nExperiência definitiva de jogos para PC\r\nOs processadores AMD Ryzen e as placas de vídeo AMD Radeon com Windows possibilitam a experiência definitiva de jogos por meio de gráficos superiores, desempenho incrível, recursos de segurança otimizados e suporte para os recursos mais recentes.\r\n\r\n \r\n\r\nEficiência incrível\r\nDe maneira impressionante, os ganhos de desempenho da arquitetura “Zen 3” podem ser fornecidos sem aumento no consumo de energia ou TDP.",
        "estoque": 3,
        "id": 8,
        "imagem": "pre_imagens/processador-amd-ryzen-7-5700x-cache-36mb-3-8ghz-4-6ghz-max-turbo-amd.jpg",
        "largura": 10.0,
        "nome": "Processador AMD Ryzen 7 5700X, 3.4GHz (4.6GHz Max Turbo), Cache 36MB, AM4, Sem Vídeo - 100-100000926WOF",
        "peso": 0.3,
        "preco": 1999.99,
        "preco_promocional": 0.0,
        "publico": 1,
        "slug": "processador-amd-ryzen-7-5700x-34ghz-46ghz-max-turbo-cache-36mb-am4-sem-video-100-100000926wof"
    },
    {
        "altura": 30.0,
        "categoria": "KIT",
        "comprimento": 30.0,
        "descricao_longa": "Console Sony PS5\r\n \r\n\r\nExperimente o carregamento extremamente rápido do SSD de ultra-velocidade, uma imersão mais profunda com suporte à resposta tátil, gatilhos adaptáveis e áudio 3D. Além de uma geração totalmente nova de jogos incríveis.\r\n\r\nO console PS5 oferece novas possibilidades de jogabilidade que você nunca imaginou. \r\n\r\n \r\n\r\nControle Sem Fio\r\nResposta tátil: As vibrações responsivas reagem às suas escolhas no jogo e simulam fatores ambientais em jogos selecionados do PS5. Inicie uma conversa com o microfone embutido.\r\n\r\n \r\n\r\nExperimente gráficos 4K nítidos\r\nCom jogos compatíveis do PS5, cada pequeno detalhe ganha vida em uma TV 4K.",
        "estoque": 1,
        "id": 9,
        "imagem": "pre_imagens/console-sony-ps5-god-of-war-ragnar.jpg",
        "largura": 30.0,
        "nome": "Console Sony PS5 + God of War Ragnarök, Branco",
        "peso": 2.0,
        "preco": 4139.99,
        "preco_promocional": 0.0,
        "publico": 1,
        "slug": "console-sony-ps5-god-of-war-ragnarok-branco"
    }
]